/**
 * Author:
 * Bao H.-W.-S. (https://psychbruce.github.io)
 */


/* Custom JS Functions */

// NOTE: When using JS functions, parameters should be defined in order!

function keyCode(character) {
    return jsPsych.pluginAPI.convertKeyCharacterToKeyCode(character)
}

function inputDialog(title, default_text) {
    var input = prompt(msg = title, defaultText = default_text)
    return input
}

function timer() {
    var second = document.getElementById('timer')//在timer函数内部，通过getElementById获取页面上ID为timer的元素
    var button = document.getElementsByClassName('jspsych-btn')[0]//获取页面上所有类名为jspsych-btn的第一个元素，这通常就是我们的按钮。
    if (second != null) {
        if (second.innerHTML > 1) {
            second.innerHTML = second.innerHTML - 1//将second元素的文本减1，实现倒计时的效果。
        } else {
            button.innerHTML = '查看报告'
            button.disabled = false
        }
    }
}

function addRespFromButtonScale(data, scale_name, var_i = 'i') {
    // 确保 data 对象中有 button_pressed 属性
    if (data.button_pressed) {
    // 将字符串选项转换为数字
        data.response = parseInt(data.button_pressed) + 1 // raw: 0, 1, 2, ...
    } else {
        console.error('No button pressed data available.');
    }

    // compute variables from button-plugin response (for likert scale)
    data.scale = scale_name
    data.varname = scale_name + data[var_i]
    
    // 检查是否有反向计分
    if (data.Reversescoring === 1) {
        // 应用反向计分逻辑
        data.response = 6 - data.response; // 反向计分
    }
}


function SUM(scale_name) {
    // 获取指定量表的数据
    var df = jsPsych.data.get().filter({ scale: scale_name }).values();
    var sum = 0;

    df.forEach(function(trial) {
        // 直接累加 response 值
        sum += trial.response; // 反向计分后的结果
    });

    // 定义每个量表的总分
    const full_score = {
        Control: 60,
        Rules: 20,
        Commu: 40,
        Support: 30
    };

    // 计算百分制得分
    const full_score_scale = full_score[scale_name];
    const percentage = (sum / full_score_scale)*100;
    const integerPercentage = Math.round(percentage); // 保留整数

    return integerPercentage; // 返回总分
}

// 创建一个查找表，用于根据维度组合确定报告类型
const parenting_map = [
    { id :1, type: '🕊️ ​智慧园丁', description: '低低高高'},
    { id: 2, type: '📖 ​留白绘本', description: '低低高低' },
    { id: 3, type: '🌌 星空守望者', description: '低低低高' },
    { id: 4, type: '🍃 ​风之轨迹', description: '低低低低' },
    { id: 5, type: '🎨​ 调色盘伙伴', description: '低高高高' },
    { id: 6, type: '🌫️​ 雾中花园', description: '低高低低' },
    { id: 7, type: '🧩 拼图观察员', description: '低高高低' },
    { id: 8, type: '🍯​ 蜜罐港湾', description: '低高低高' },
    { id: 9, type: '🌉​ 渡桥导师', description: '高低高高' },
    { id: 10, type: '📜 法典学者', description: '高低高低' },
    { id: 11, type: '🛡️ 静默盾牌', description: '高低低高' },
    { id: 12, type: '🗝️ 密码锁', description: '高低低低' },
    { id: 13, type: '🌟 变幻围城', description: '高高高高' },
    { id: 14, type: '🏰​ 糖霜堡垒', description: '高高低高' },
    { id: 15, type: '⚙️​ 齿轮摇篮', description: '高高低低' },
    { id: 16, type: '⚖️ 矛盾导师', description: '高高高低' },
]

/*
const standards = {
        Support: 72.5,
        Rules: 40,
        Discipline: 40,
        Control: 37.5,
*/

function generate_parenting_type() {//判断每个分量表的水平，获得报告名称
    // 定义评分标准
    const standards = {
        Control: 50,
        Rules: 50,
        Commu: 50,
        Support: 50,
    };

    // 计算每个量表的总分
    const scores = {
        Control: SUM('Control'),
        Rules: SUM('Rules'),
        Commu: SUM('Commu'),
        Support: SUM('Support')
    };

    // 定义水平标签
    const levels = {
        '高于': '高',
        '低于': '低'
    };

    // 判断每个量表的水平
    const evaluateLevel = (score, standard) => score >= standard ? levels['高于'] : levels['低于'];
    const levelsResult = {
        Control: evaluateLevel(scores.Control, standards.Control),
        Rules: evaluateLevel(scores.Rules, standards.Rules),
        Commu: evaluateLevel(scores.Commu, standards.Commu),
        Support: evaluateLevel(scores.Support, standards.Support)
    };

    //组合报告名称(各维度水平)
    const leves_combine = `${levelsResult.Control}${levelsResult.Rules}${levelsResult.Commu}${levelsResult.Support}`;
        
    const reportInfo = parenting_map.find(config => config.description === leves_combine);
    const parenting_type = reportInfo ? reportInfo.type : "未知类型：未匹配到任何已知组合。";
    return { type: parenting_type, description: leves_combine };
}

function generate_report(parentingTypeInfo) {
    
    // 使用查找表获取报告类型
    let report;
    const reportInfo = parenting_map.find(config => config.type === parentingTypeInfo.type);

    // 根据报告类型生成报告内容
    if (reportInfo) {
        switch (parentingTypeInfo.type) {
            //1 🕊️ ​智慧园丁：1111
            case '🕊️ ​智慧园丁':
                report = `
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                你像园丁一般为孩子创造自主生长条件​，而非强行嫁接理想果实。你像记录植物生长日记般倾听烦恼，耐心等待而非催促开花。你用微笑和拥抱提供温和滋养，但绝不泛滥成溺爱洪流。<br><br>
                
                
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                你是那种温暖又坚定的家长，全方位地关注孩子的成长，给了孩子一个充满爱的家庭环境。<br>
                在你的家里,孩子知道什么可以做,什么不可以做,ta逐渐成长为一个有教养、懂礼貌的孩子。在你眼中,孩子是宝贵且充满潜力的个体。你们设定的高标准激励孩子追求卓越,在ta的成长旅程中,你始终尽你所能地提供指导和支持,帮助ta发现自我价值和潜能,也缓解了ta追求成功可能带来的压力。你认识到,孩子需要感受到被爱和被支持,这有助于ta在成长过程中建立自信和安全感。<br><br>
                <span style="color: CornflowerBlue ">总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！你的努力和付出将帮助孩子成长为有责任感、自信和富有同情心的人。</span><br><br>
                
                <hr>
                教养风格分析<br>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br><br>

                <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。<br>
                你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                幸运的是，你会给孩子的行为设定明确的界限，强调是非对错，会及时对孩子的错误行为进行纠正或约束。<br>
                在对孩子的教育中,“无所谓”的态度是不存在的,你带ta来到这个世界上,你会对ta负责,承担起父母的责任。<br>
                尽管你尽力满足孩子的需求，但这是有界限的。<br>
                必要的时候,你会拒绝孩子的过分要求,并对ta进行正确的引导。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你是那种和孩子聊得来的家长,是孩子的知心朋友,因为你总能换位思考,充分考虑孩子的感受,并耐心地对待ta。有时,你也会让孩子表达自己的感受,给予ta回应。每一次的耐心沟通和引导,都使得你与孩子之间的纽带得以加深。<br>
                你允许孩子表达自己的意见,让ta学会从不同角度看待问题,培养孩子自主思考的能力,而不是被动接受父母的观点,你让ta意识到“自己也是这个家的一员”。尽管有时候孩子会犯错,让你火冒三丈,但你尽量让自己理性地与ta讨论,接纳ta的想法和感受。<br>
                在孩子的成长道路上,你尽力做好“引路人”的角色。你会让孩子理解行为的对错,而不仅仅是简单地惩罚或奖励。你会鼓励ta主动做出积极的选择,而不是通过强制手段强迫ta遵守规则。
                <br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心,无论ta烦恼还是喜悦,你总能第一时间给ta安慰和支持。你的孩子常常会感受到被爱、被赞赏和被接纳。<br>
                无论多忙,你都会安排时间与孩子一起参与ta感兴趣的活动,比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动,探索新事物,尝试不同的活动和兴趣,即使ta可能会失败,你也会支持ta。<br>
                <br>

                在某些方面，你的教养风格让人联想到运动员傅园慧的爸爸。他始终对女儿抱有高标准和高期望，同时他也注意用自己的方式表达对女儿的支持与爱护，告诉她“你是最好的，你是最棒的，你是天才”。在他看来，赢得冠军固然很棒，但如果没能拿到，也不是什么大不了的事。只要尽力了，快乐就好。在此环境中，傅园慧也成长为一个“完全接纳自己”的快乐女孩。<br>
                <br>

                <hr>
                <p text-align: center>【教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ● 【庆祝努力和进步】:鼓励孩子不仅仅关注最终的成就,而且也要认识到努力过程中的进步同样重要。每当孩子在学习、体育或其他活动中付出努力时,即使结果不是完美的,也要表扬ta的坚持和努力。你可以举办小型的庆祝活动来认可ta的努力,比如家庭晚餐或周末的特别活动。<br>
                ● 【作为榜样】：在很大程度上，孩子的行为会模仿父母，你的行为和态度会对孩子产生重要影响。努力在日常生活中展现出你希望孩子学习的品质和行为，比如诚实、尊重、责任感和同情心。<br>
                ● 【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                
                `;
                break;
            //2 📖 ​留白绘本：1112
            case '📖 ​留白绘本':
                report = `
                理性探讨人生选项，但保持情感距离，孩子如阅读未完成的故事书，需自行填补空白页。<br/><br/>

                你重视与孩子的沟通和引导，鼓励孩子自主思考和表达，既不过于严格，也不过度放纵，努力在爱与规则之间找到平衡点。<br>
                在你的家里，孩子知道什么可以做,什么不可以做,ta逐渐成长为一个有教养、懂礼貌的孩子。在你眼中,孩子是宝贵且充满潜力的个体。你设定的高标准激励孩子追求卓越,在ta的成长旅程中,你始终尽你所能地提供指导和支持,帮助ta发现自我价值和潜能,也缓解了ta追求成功可能带来的压力。<br>
                美中不足的是，也许在日常生活中，你偶尔会因为某些原因而忽略了孩子的情感需求。孩子可能会认为你有时候比较冷漠。尽管如此,在孩子心里ta仍然爱你,就像你一直爱着ta。我们都知道,好的关系往往需要用心经营,下一次回到家的时候,尝试从一个拥抱或者微笑开始吧！<br>
                总体而言，做好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧。你的努力和付出将帮助孩子成长为有责任感、自信和富有同情心的人。<br>
                
                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br><br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                幸运的是,你会给孩子的行为设定明确的界限,强调是非对错,会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中,“无所谓”的态度是不存在的,你带ta来到这个世界上,你会对ta负责,承担起父母的责任。<br>
                尽管你尽力满足孩子的需求，但这是有界限的。必要的时候,你会拒绝孩子的过分要求,并对ta进行正确的引导。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你是那种和孩子聊得来的家长,是孩子的知心朋友,因为你总能换位思考,充分考虑孩子的感受,并耐心地对待ta。有时,你也会让孩子表达自己的感受,给予ta回应。每一次的耐心沟通和引导,都使得你与孩子之间的纽带得以加深。<br>
                你允许孩子表达自己的意见,让ta学会从不同角度看待问题,培养孩子自主思考的能力,而不是被动接受父母的观点,你让ta意识到“自己也是这个家的一员”。尽管有时候孩子会犯错,让你火冒三丈,但你尽量让自己理性地与ta讨论,接纳ta的想法和感受。<br>
                在孩子的成长道路上,你尽力做好“引路人”的角色。你会让孩子理解行为的对错,而不仅仅是简单地惩罚或奖励。你会鼓励ta主动做出积极的选择,而不是通过强制手段强迫ta遵守规则。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                在日常生活中，也许你更多地关注孩子学习上的进步，但别忘了，你的情感支持同样也是孩子成长的“养分”。<br>
                有时候可以是一个爱的眼神，也可以是用“今天在学校开心吗？”来代替“今天学到了什么？”，还可以是一个充满信任的目光。<br>
                拥抱、赞扬、支持、陪伴……这些都传递了一个信号，那就是:爸爸妈妈永远站在你这一边。而这个信号就像海边的灯塔,你的孩子会充满安全感地扬帆起航，即便遇到了风浪,ta也能找到家的方向。<br>
                <br>

                <hr>
                <p text-align: center>【教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ● 【庆祝努力和进步】:鼓励孩子不仅仅关注最终的成就,而且也要认识到努力过程中的进步同样重要。每当孩子在学习、体育或其他活动中付出努力时,即使结果不是完美的,也要表扬ta的坚持和努力。你可以举办小型的庆祝活动来认可ta的努力,比如家庭晚餐或周末的特别活动。<br>
                ● 【为孩子提供情感支持的技巧】：<br>
                    ○倾听与理解<br>
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。<br>
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。<br>
                    ○鼓励与支持<br>
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”<br>
                        ■ 关注进步：关注孩子的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”<br>
                    ○提供陪伴<br>
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。<br>
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                
                `;
                break;
            //3 🌌 星空守望者：1121
            case '🌌 星空守望者':
                report = `
                默默给予情感支持却不干涉选择，如同遥望星空静待孩子发光。<br/><br/>

                你是那种绝对不会溺爱孩子，温暖又坚定的家长。你全方位地关注孩子的成长，为孩子营造了一个充满爱的家庭环境。 <br>
                在你的家里,孩子知道什么可以做,什么不可以做,ta逐渐成长为一个有教养、懂礼貌的孩子。在你眼中,孩子是宝贵且充满潜力的个体。你设定的高标准激励着孩子追求卓越。你认识到,孩子需要感受到被爱和被支持，这有助于ta在成长过程中建立自信和安全感。<br>
                根据测试结果，你还能在【沟通和引导】方面做得更好。沟通意味着“尽管犯错但仍然能被理解”，引导则是“尽管犯错但仍能走向正确方向”。<br>
                当孩子做出某些行为时,你可能只是简单地告诉他们“不能这么做”,而没有进一步解释“为什么不能这么做”。然而，随着孩子逐渐长大,ta开始形成自己对世界的认知和理解。即使孩子做出了正确的行为，也可能因为缺乏对行为背后原因的理解而感到困惑。孩子需要的不仅仅是行为的结果，更是行为背后的原因。<br>
                积极的沟通和正向的引导对孩子的人格发展、社会交往和价值观塑造至关重要。也许你已经意识到了这一点，并正在努力改进。<br>
                总之，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！你的努力和付出将帮助孩子成为一个有责任感、自信和富有同情心的人。<br>


                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                幸运的是,你会给孩子的行为设定明确的界限,强调是非对错,会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中,“无所谓”的态度是不存在的,你带ta来到这个世界上,你会对ta负责,承担起父母的责任。<br>
                尽管你尽力满足孩子的需求，但这是有界限的。必要的时候,你会拒绝孩子的过分要求,并对ta进行正确的引导。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                沟通意味着双方都能够表达自己的观点和看法,就像宇宙中两个空间站之间一来一回的交流。我们可能会认为“小孩子嘛，懂什么?只要跟ta说明对错就可以了”。<br>
                但事实是,孩子对世界有ta自己的看法。在日常生活中,可能大多数时候,你只是告诉孩子不能这么做,但却很少跟ta解释为什么不要这么做。这可能会让ta觉得困惑,并很难在今后的某些场合做出适当的行为表现。<br>
                事实上,孩子形成世界观的过程,正是我们进行引导的最佳时机。我们希望孩子“明是非”,就需要同ta“讲道理”。<br>
                另外，沟通不仅仅是语言沟通，你与孩子的每一次互动都是一种交流，包括了你说的话、你的语气、眼神以及你的拥抱和亲吻。<br>
                沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上,没有及时给与ta回应。<br>
                沟通是我们的方式,引导是我们的目的。你与孩子交流的方式不仅教会ta如何与他人交流,还塑造了ta的情感发展,并影响ta在今后生活中建立关系。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心,无论ta烦恼还是喜悦,你总能第一时间给ta安慰和支持。你的孩子常常会感受到被爱、被赞赏和被接纳。<br>
                无论多忙,你都会安排时间与孩子一起参与ta感兴趣的活动,比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动,探索新事物，尝试不同的活动和兴趣,即使ta可能会失败,你也会支持ta。<br>
                <br>

                <hr>
                <p text-align: center>【教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ● 【积极倾听】:通过使用鼓励性微笑和肯定性点头等动作,让你的孩子知道你正在认真倾听。当孩子与你交谈时,请俯下身子与孩子保持同一视线高度,这样可以让ta感到更安全,与你建立更紧密的联系。<br>
                ●【关注行为而非个人】:如果你对孩子某件事感到不满,请确保你的批评和评论是针对ta的行为,而不是针对个人。例如，不要说“为什么你总是这样？”，试着说“我不喜欢你把衣服扔得到处都是”。<br>
                ●【正向引导】：<br>
                    ○直接表达你想让孩子做什么，而非不要做什么。例如，“好好走路”、或“坐在椅子上”，而不是“不要跑”、“不要大喊大叫”或“不要爬到桌子上”。<br>
                    ○给孩子提供选择。给孩子机会自主做选择，不仅能让他感受到掌控感，还能让他有机会练习做出正确的决定。例如，当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？ ”在措辞时,让孩子有选择的空间和权力,这可以减少ta对指示的抵触情绪。<br>
                    ○为孩子制定清晰一致的规则。向孩子清楚地传达这些规则，并正在孩子做到的时候给予鼓励和一定的奖励。<br>

                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>

                `;
                break;
            //4 🍃 ​风之轨迹：1122
            case '🍃 ​风之轨迹':
                report = `
                完全遵循自然法则，情感与规则皆隐形，孩子如风中种子自主寻找方向。<br/>
                <br/>

                很明显,你不是那种会溺爱孩子的家长,而且严厉的责备、体罚和批评并不会出现在你的家里。你不会随意对孩子发脾气，虽然你无条件地爱着你的孩子,但你不会无条件地满足ta一切要求。你努力避开那些对孩子有负面影响的行为，这是你承担父母责任的体现。<br>
                在育儿的道路上，知道哪个方向不对，这已经很了不起了。但有的时候，你可能还是会感到一定的育儿压力。这是因为，想要帮助孩子成长，我们不仅要知道不能做什么，还需要知道能做些什么。<br>
                好消息是，从测评结果来看，你还能在【情感支持】和【沟通引导】这两个方面获得一些育儿启发。<br>
                沟通意味着“尽管犯错但仍然能被理解”，引导则是“尽管犯错但仍能走向正确方向”。当孩子做出某些行为时，你可能只是简单地告诉他们“不能这么做”，而没有进一步解释“为什么不能这么做”。然而，孩子需要的不仅仅是结果，还有行为背后的原因。积极沟通和正向引导，对孩子的人格、社交和价值观塑造极为关键。你或许已经意识到这点，正在努力改进。<br>
                另外，可能在日常生活中,你不会怎么跟孩子进行深度交流,了解ta的想法和感受,你的爱更多时候是沉默的。你可能不习惯跟孩子拥抱或者开玩笑，没有关系，每个父母都有自己的方法表达对孩子的爱。如果你不知道怎么做，可以试着从一个微笑开始。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>


                 <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                幸运的是,你会给孩子的行为设定明确的界限,强调是非对错,会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中,“无所谓”的态度是不存在的,你带ta来到这个世界上,你会对ta负责,承担起父母的责任。<br>
                尽管你尽力满足孩子的需求，但这是有界限的。必要的时候,你会拒绝孩子的过分要求,并对ta进行正确的引导。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                沟通意味着双方都能够表达自己的观点和看法,就像宇宙中两个空间站之间一来一回的交流。我们可能会认为“小孩子嘛，懂什么?只要跟ta说明对错就可以了”。<br>
                但事实是,孩子对世界有ta自己的看法。在日常生活中,可能大多数时候,你只是告诉孩子不能这么做,但却很少跟ta解释为什么不要这么做。这可能会让ta觉得困惑,并很难在今后的某些场合做出适当的行为表现。<br>
                事实上,孩子形成世界观的过程,正是我们进行引导的最佳时机。我们希望孩子“明是非”,就需要同ta“讲道理”。<br>
                另外，沟通不仅仅是语言沟通，你与孩子的每一次互动都是一种交流，包括了你说的话、你的语气、眼神以及你的拥抱和亲吻。<br>
                沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上,没有及时给与ta回应。<br>
                沟通是我们的方式,引导是我们的目的。你与孩子交流的方式不仅教会ta如何与他人交流,还塑造了ta的情感发展,并影响ta在今后生活中建立关系。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                在日常生活中，也许你更多地关注孩子学习上的进步，但别忘了，你的情感支持同样也是孩子成长的“养分”。<br>
                有时候可以是一个爱的眼神，也可以是用“今天在学校开心吗？”来代替“今天学到了什么？”，还可以是一个充满信任的目光。<br>
                拥抱、赞扬、支持、陪伴……这些都传递了一个信号，那就是：爸爸妈妈永远站在你这一边。而这个信号就像海边的灯塔，你的孩子会充满安全感地扬帆起航，即便遇到了风浪,ta也能找到家的方向。<br>
                <br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【为孩子提供情感支持的技巧】：<br>
                    ○倾听与理解<br>
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。<br>
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。<br>
                    ○鼓励与支持<br>
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”<br>
                        ■ 关注进步：关注孩子的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”<br>
                    ○提供陪伴<br>
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。<br>
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。<br>
                ●【正向沟通】：<br>
                    ○与孩子交谈时，减少使用权威的语气或强迫语气，例如：“你必须听我的、我这么做都是为你、我都是为你好”。<br>
                    ○少用反问语气，例如“你认为这样做合适吗？”“你觉得你这样做对吗？”可以说“我有些担心这样做是否合适，你觉得呢？”说话时保持冷静，用温和的言辞。不要使用尖刻和难听的言语。<br>
                    ○用正向的话语代替，例如用“你勤快的样子真帅”，“妈妈很喜欢你勤快的样子”代替“你怎么总是那么懒”。<br>
                ●【庆祝努力和进步】：鼓励孩子不仅仅关注最终的成就，而是认识到努力过程中的进步同样重要。每当孩子在学习、体育或其他活动中付出努力时，即使结果不是完美的，也要表扬ta的坚持和努力。你可以举办小型的庆祝活动来认可ta的努力，比如家庭晚餐或周末的特别活动。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //5 🎨​ 调色盘伙伴：1211
            case '🎨​ 调色盘伙伴':
                report = `
                放任孩子自由探索，通过积极对话与情感支持赋能，像提供颜料却不画框架的艺术家伙伴，适合创造力强的孩子。<br><br>

                你和孩子的相处像伙伴一般，你尊重孩子，允许ta自由探索。在你眼中，孩子是宝贵且充满潜力的个体，因此你尽力提供多种“颜料”来满足孩子的需求，给予ta指导和支持，帮助ta发现自我价值和潜能。你为孩子营造了一个充满爱和安全感的家庭环境，这让ta更加积极主动地去尝试新事物。<br>
                美中不足的是，你可能没有注意到，有时候面对孩子时，你比较容易心软。例如，孩子撒撒娇就能得到自己喜欢的玩具，孩子鞋袜乱丢，你跟着在后面收拾，孩子大了还一直睡在妈妈的床上……你没有严格的规定，会灵活地调整自己的期待，尽可能满足孩子的需求。<br>
                然而，要警惕的是，“不设画框”只会让孩子模糊行为边界，无条件的包容和退让反而容易让孩子缺乏规则意识和自我约束能力。因此，在孩子探索世界的画布上设立适当的画框，让孩子在框架和秩序下学会丈量自由的尺度，方能在人生画卷上展现出兼具安全感与创造力的生命图景。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>

                  <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                在规则和纪律方面，你没有非常严格的规定，大部分时候你只是根据孩子的需要灵活调整。也许并没有达到溺爱的程度，但如果你对孩子比较心软，没有给孩子设定明确的界限和规则，没有强调是非对错,让孩子自由生长，这可能会导致孩子缺乏规则意识,习惯于父母无条件的满足,可能会让ta变得以自我为中心,过分依赖父母，丧失独立思考和解决问题的能力。因此，在孩子自由探索的时候,也别忘了设定明确的行为边界。<br>
                请记住，在必要的时候，你可以拒绝孩子不合理或不恰当的要求,并对ta进行正确的引导。如果你不知道如何温柔又坚定地拒绝孩子,可以参考后面的育儿建议。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你是那种和孩子聊得来的家长，是孩子的知心朋友，因为你总能换位思考，充分考虑孩子的感受,并耐心地对待ta。有时,你也会让孩子表达自己的感受,给予ta回应。每一次的耐心沟通和引导,都使得你与孩子之间的纽带得以加深。<br>
                你允许孩子表达自己的意见,让ta学会从不同角度看待问题,培养孩子自主思考的能力,而不是被动接受父母的观点,你让ta意识到“自己也是这个家的一员”。尽管有时候孩子会犯错,让你火冒三丈,但你尽量让自己理性地与ta讨论,接纳ta的想法和感受。<br>
                在孩子的成长道路上，你尽力做好“引路人”的角色。你会让孩子理解行为的对错,而不仅仅是简单地惩罚或奖励。你会鼓励ta主动做出积极的选择,而不是通过强制手段强迫ta遵守规则。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心,无论ta烦恼还是喜悦,你总能第一时间通过你的行为给ta安慰和支持。作为你的孩子,常常会感受到被爱、被赞赏和被接纳。<br>
                无论多忙,你都会安排时间与孩子一起参与ta感兴趣的活动,比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，探索新事物，尝试不同的活动和兴趣,即使ta可能会失败,你也会支持ta。<br>
                <br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【设立规则和边界】：<br>
                    ○规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○告诉孩子ta可以做什么,而不是不可以做什么。例如，少说“不要把蜡笔放进嘴里”,多说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事,ta的注意力反而会集中在这件事情上，更容易引发逆反心理。<br>
                    ○明确告知孩子规则,如果ta已经到了能理解的年纪,跟ta解释规则背后的原因,这样ta遵守规则的概率会更高。<br>
                    ○明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就可以吃”，而不是“不，该吃晚饭了！” <br>
                    ○与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //6 🌫️​ 雾中花园：1222
            case '🌫️​ 雾中花园':
                report = `
                提供舒适环境却无方向指引，无限提供游戏装备却从不过问生活，没有责骂体罚给予无限自由，机械式物质给予替代陪伴，情感与沟通皆模糊，孩子如雾里看花，易陷入迷茫与依赖。<br><br>

                很明显，你不是那种会随意对孩子发脾气的家长，严厉的责备、体罚和批评并不会出现在你的家里。但你似乎很少与孩子设定清晰的规则和界限，面对孩子的某些要求，尽管你并不想答应，但很多时候你还是会妥协和心软。那些未被明确的"可以"与"不可以"，如同花园中未设路标的岔径，容易让孩子模糊行为边界，难以在某些场合做出适当的行为。<br>
                另外，你似乎很难跟孩子进行有效沟通，当孩子需要情感回应时，你可能不擅长鼓励、拥抱等亲昵的情感表达。你与孩子的日常对话更多停留在事务性沟通（例如"作业写完了吗"），你可能会发现，你较难与孩子开启关于感受、想法的深度交流。你的爱更多时候是沉默的，就像笼罩在雾中，孩子可能会觉得模糊不清，想要靠近却找不到清晰的目标。<br>
                这种"低要求高回避"的养育方式，让孩子习惯了物质供给的恒温，却对情感回应的周期失去预期。<br>
                但不可否认的是，你的爱是真实存在的，我们可以试图让爱变得更加清晰。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信和富有同情心的人。<br>


                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>
                你尊重孩子,不会随意打断孩子,你也常常倾听孩子,耐心地跟ta解释规则背后的原因,并用你的行动告诉ta:爸爸/妈妈永远爱你。你给予了孩子足够的安全感。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                在规则和纪律方面，你没有非常严格的规定，大部分时候你只是根据孩子的需要灵活调整。也许并没有达到溺爱的程度，但如果你对孩子比较心软，没有给孩子设定明确的界限和规则，没有强调是非对错,让孩子自由生长，这可能会导致孩子缺乏规则意识,习惯于父母无条件的满足,可能会让ta变得以自我为中心,过分依赖父母，丧失独立思考和解决问题的能力。因此，在孩子自由探索的时候,也别忘了设定明确的行为边界。<br>
                请记住，在必要的时候，你可以拒绝孩子不合理或不恰当的要求,并对ta进行正确的引导。如果你不知道如何温柔又坚定地拒绝孩子,可以参考后面的育儿建议。<br>
                <br>

                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                沟通意味着双方都能够表达自己的观点和看法。我们可能会认为“小孩子嘛，懂什么?只要跟ta说明对错就可以了”。但事实是,孩子对世界有ta自己的看法。<br>
                在日常生活中，可能大多数时候,你只是告诉孩子不能这么做,但却很少跟ta解释为什么不要这么做,像隔着浓雾发出模糊的禁令。这可能会让ta觉得困惑,并无法在今后的某些场合做出适当的行为表现。<br>
                事实上，孩子形成世界观的过程，正是我们进行引导的最佳时机。我们希望孩子“明是非”,就需要同ta“讲道理”。<br>
                另外，沟通不仅仅是语言沟通，你与孩子的每一次互动都是一种交流，包括了你说的话、你的语气、眼神以及你的拥抱和亲吻。<br>
                沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上，没有及时给予回应。<br>
                沟通是我们的方式,引导是我们的目的。你与孩子交流的方式不仅教会ta如何与他人交流,还塑造了ta的情感发展,并影响ta在今后生活中建立关系。<br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                在日常生活中，也许你更多地关注孩子学习上的进步，但别忘了，你的情感支持同样也是孩子成长的“养分”。模糊的情感回应容易让孩子滋生不确定感，而清晰且坚定的情感支持则有助于为孩子成长提供稳固的心理锚点——就像在迷雾中点亮的航标，让孩子学会在被看见与被支持中建立内在的安全感，而非依赖外界讨好或试探来确认爱的存在。<br>
                情感支持不需要完美，有时候可以是一个爱的眼神，也可以是用“今天在学校开心吗？”来代替“今天学到了什么？”，还可以是一个充满信任的目光。<br>
                拥抱、赞扬、支持、陪伴……这些都传递了一个信号，那就是：爸爸妈妈永远站在你这一边。当爱清晰可见时，孩子才会带着被看见的笃定，驶向未知海域时，既能拥抱自由的浪花，也能随时校准回家的航向。<br>
                <br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【设立规则和边界】：<br>
                    ○规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○告诉孩子ta可以做什么,而不是不可以做什么。例如，少说“不要把蜡笔放进嘴里”,多说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事,ta的注意力反而会集中在这件事情上，更容易引发逆反心理。<br>
                    ○明确告知孩子规则,如果ta已经到了能理解的年纪,跟ta解释规则背后的原因,这样ta遵守规则的概率会更高。<br>
                    ○明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就可以吃”，而不是“不，该吃晚饭了！” <br>
                    ○与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>
                ●【倾听小妙招】：<br>
                    ○尽可能地留意孩子说的话，并给予回应<br>
                    ○如果你工作很忙，请确保定期留一些实践坐下来跟孩子聊天。<br>
                    ○鼓励孩子表达自己的想法和意见。积极的沟通是双向的，双方轮流倾听和交谈。<br>
                    ○使用鼓励性微笑和肯定性点头。<br>
                ●【正向沟通】：<br>
                    ○与孩子交谈时，减少使用权威的语气或强迫语气，例如：“你必须听我的”。<br>
                    ○少用反问语气，例如“你认为这样做合适吗？”“你觉得你这样做对吗？”可以说“我有些担心这样做是否合适，你觉得呢？”说话时保持冷静，用温和的言辞。不要使用尖刻和难听的言语。<br>
                    ○用正向的话语代替抱怨，例如用“你勤快的样子真帅”，“妈妈很喜欢你勤快的样子”代替“你怎么总是那么懒”。<br>
                ●【为孩子提供情感支持的技巧】：<br>
                    ○倾听与理解<br>
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。<br>
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。<br>
                    ○鼓励与支持<br>
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”<br>
                        ■ 关注进步：关注孩子的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”<br>
                    ○提供陪伴<br>
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。<br>
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //7 🧩 拼图观察员：1212
            case '🧩 拼图观察员':
                report = `
                允许孩子主导选择，像旁观者一样协助孩子完成成长的拼图。平淡理性分析行为的后果，却很少进行干预，让孩子在自由探索中学习和成长。<br><br>

                你的教养风格如同精妙的拼图艺术，作为「拼图观察员」，你以尊重和平等为基石，理性沟通如同拼图指引手册帮助定位关键碎片。当孩子犯错时,你更倾向于与TA共同分析问题、启发思考,而非简单说教或强制服从。这种开放、鼓励表达的教育方式,让孩子感受到信任与支持。<br>
                但需要留意的是，你的包容心有时会模糊必要的规则边界。例如，面对孩子的撒娇或拖延（如随意满足非必要的玩具需求），你容易因心软而妥协，也许有时你还会主动代劳本应孩子承担的责任（如反复收拾乱丢的鞋袜）。<br>
                这种「灵活调整期待」的初衷虽出于关爱,却可能在不经意间阻碍孩子发展自主能力——TA可能习惯依赖你的退让与帮助,而错失独立解决问题的机会。<br>
                此外，你对孩子的爱更多体现在务实的引导中，鲜少通过肢体语言或轻松互动传递情感。理性沟通固然重要，但若长期缺乏拥抱、玩笑等亲密表达，孩子可能难以感知到情感层面的紧密联结。不妨尝试在日常交流中融入更多温暖细节：一个鼓励的击掌、一次共同大笑的瞬间，都能为你们的关系注入更多温度。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>
                <br>


                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中，很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子，而是像搭建植物攀援架般设立行为边界，用「规则讲解+行为示范」取代强制命令。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                你在规则设定上更倾向于「弹性引导」：没有刻板的条框约束孩子,而是根据TA的成长阶段和具体情境灵活调整边界。这种包容的初衷本是为了呵护孩子的天性,但若因心软而持续退让（如默认ta饭前吃零食、纵容长时间拖延作业），可能会使孩子将「灵活」误解为「无界」。<br>
                要知道，拼图的魅力在于每个碎片最终都要回归应属的位置——当孩子撒娇拖延时,你的坚定回应反而能帮助TA看清成长拼图的全貌。<br>
                请记住，在必要的时候,你可以拒绝孩子不合理或不恰当的要求,并对ta进行正确的引导。如果你不知道如何温柔又坚定地拒绝孩子,可以参考后面的育儿建议。<br>


                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                在孩子的成长道路上,你尽力做好“引路人”的角色。如同拼图观察员解析图块关联,你会让孩子理解行为的对错,而不仅仅是简单地惩罚或奖励。你会鼓励ta主动做出积极的选择，而不是通过强制手段强迫ta遵守规则。<br>
                你尊重孩子的自主性,允许孩子表达自己的意见,而不是被动接受父母的观点。你允许孩子对家庭规则提出自己的意见,让ta意识到“自己也是这个家的一员”。尽管有时候孩子会犯错，让你火冒三丈，但你始终保持观察者的清醒，尽量让自己理性地与ta讨论，并给予引导。<br>

                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                在日常生活中，也许你更多地关注孩子学习上的进步，但别忘了，你的情感支持同样也是孩子成长的“养分”。模糊的情感回应容易让孩子滋生不确定感，而清晰且坚定的情感支持则有助于为孩子成长提供稳固的心理锚点——就像在迷雾中点亮的航标，让孩子学会在被看见与被支持中建立内在的安全感，而非依赖外界讨好或试探来确认爱的存在。<br>
                情感支持不需要完美，有时候可以是一个爱的眼神，也可以是用“今天在学校开心吗？”来代替“今天学到了什么？”，还可以是一个充满信任的目光。<br>
                拥抱、赞扬、支持、陪伴……这些都传递了一个信号，那就是：爸爸妈妈永远站在你这一边。当爱清晰可见时，孩子才会带着被看见的笃定，驶向未知海域时，既能拥抱自由的浪花，也能随时校准回家的航向。<br>
                <br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【为孩子提供情感支持的技巧】：<br>
                    ○倾听与理解<br>
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。<br>
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。<br>
                    ○鼓励与支持<br>
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”<br>
                        ■ 关注进步：关注孩子<br>的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”<br>
                    ○提供陪伴<br>
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。<br>
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。<br>
                ●【设立规则和边界】：<br>
                    ○规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○告诉孩子ta可以做什么,而不是不可以做什么。例如，少说“不要把蜡笔放进嘴里”,多说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事,ta的注意力反而会集中在这件事情上,更容易引发逆反心理。<br>
                    ○明确告知孩子规则,如果ta已经到了能理解的年纪,跟ta解释规则背后的原因,这样ta遵守规则的概率会更高。<br>
                    ○明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就可以吃”，而不是“不，该吃晚饭了！” <br>
                    ○与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //8 🍯​ 蜜罐港湾：1221
            case '🍯​ 蜜罐港湾':
                report = `
                无条件包容与宠爱，但是避免冲突与深度交流，孩子如船停泊在甜蜜港湾，可能延缓抗压能力发展。<br><br>
                
                你是那种温暖的家长，全方位关注孩子的成长，为孩子营造了一个充满爱和安全感的甜美港湾，你的怀抱永远向孩子敞开,让ta能安心停泊休憩。<br>
                你尽可能满足孩子的需求，但你似乎很少与孩子设定清晰的规则和界限。面对孩子的某些要求，尽管你并不想答应，但很多时候你还是会妥协和心软。<br>
                另外，在沟通引导方面，你还能做得更好。沟通意味着“尽管犯错但仍然能被理解”，引导则是“尽管犯错但仍能走向正确方向”。当孩子做出某些行为时，你可能只是简单地告诉他们“不能这么做”，而没有进一步解释“为什么不能这么做”。然而，随着孩子逐渐长大，他们开始形成自己对世界的认知和理解。即使他们做出了正确的行为，也可能因为缺乏对行为背后原因的理解而感到困惑。孩子需要的不仅仅是行为的结果，更是行为背后的原因。<br>
                积极的沟通和正向的引导对孩子的人格发展、社会交往和价值观塑造至关重要。也许你已经意识到了这一点，并正在努力改进。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>
                <br/>

            

                 <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你在教育孩子的过程中,很少通过责备、批评、体罚、冷暴力、道德绑架等手段来管教孩子。你不会要求孩子绝对服从,你尊重孩子并给予ta一定的自由。你向孩子展示这个世界,允许ta在你的保护下,自由探索。<br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                在规则和纪律方面，你没有非常严格的规定，大部分时候你只是根据孩子的需要灵活调整。也许并没有达到溺爱的程度，但如果你对孩子比较心软，没有给孩子设定明确的界限和规则，没有强调是非对错，让孩子自由生长，这可能会导致孩子缺乏规则意识，习惯于父母无条件的满足，可能变得以自我为中心，过分依赖父母，丧失独立思考和解决问题的能力。<br>
                请记住，在必要的时候,你可以拒绝孩子的过分要求,并对ta进行正确的引导。如果你不知道如何温柔又坚定地拒绝孩子,可以参考后面的育儿建议。<br>



                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                沟通意味着双方都能够表达自己的观点和看法。我们可能会认为“小孩子嘛，懂什么?只要跟ta说明对错就可以了”。<br>
                但事实是,孩子对世界有ta自己的看法。在日常生活中,可能大多数时候,你只是告诉孩子不能这么做,但却很少跟ta解释为什么不要这么做。这可能会让ta觉得困惑,并无法在今后的某些场合做出适当的行为表现。<br>
                事实上，孩子形成世界观的过程，正是我们进行引导的最佳时机。我们希望孩子“明是非”,就需要同ta“讲道理”。<br>
                另外，沟通不仅仅是语言沟通，你与孩子的每一次互动都是一种交流，包括了你说的话、你的语气、眼神以及你的拥抱和亲吻。<br>
                沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上，没有及时给予回应。<br>
                沟通是我们的方式,引导是我们的目的。你与孩子交流的方式不仅教会ta如何与他人交流,还塑造了ta的情感发展,并影响ta在今后生活中建立关系。<br>


                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心,无论ta烦恼还是喜悦,你总能第一时间通过你的行为给ta安慰和支持。作为你的孩子,常常会感受到被爱、被赞赏和被接纳。<br>
                无论多忙,你都会安排时间与孩子一起参与ta感兴趣的活动,比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，探索新事物，尝试不同的活动和兴趣,即使ta可能会失败,你也会支持ta。<br>


                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                要知道，作为父母，你已经做得非常出色了，未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【设立规则和边界】：<br>
                    ○规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○告诉孩子ta可以做什么,而不是不可以做什么。例如，少说“不要把蜡笔放进嘴里”,多说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事,ta的注意力反而会集中在这件事情上,更容易引发逆反心理。<br>
                    ○明确告知孩子规则,如果ta已经到了能理解的年纪,跟ta解释规则背后的原因,这样ta遵守规则的概率会更高。<br>
                    ○明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就可以吃”，而不是“不，该吃晚饭了！” <br>
                    ○与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>
                ●【积极倾听】:通过使用鼓励性微笑和肯定性点头等动作,让你的孩子知道你正在认真倾听,你关心ta。当孩子与你交谈时,请俯下身子与孩子保持同一视线高度,这样可以帮助ta感到更安全，与你建立更紧密的联系。<br>
                ●【正向引导】：<br>
                    ○直接表达你想让孩子做什么，而不是不要做什么。例如，“好好走路”、或“坐在椅子上”，而不是“不要跑”、“不要大喊大叫”或“不要爬到桌子上” 。<br>
                    ○给孩子提供选择。让孩子有机会自己做选择,有助于ta感受到控制感,并让ta有机会练习做出正确的决定。例如,当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？ ”在措辞时，让孩子有机会决定如何遵守，这可以减少ta对指示的抵触情绪。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //9 🌉​ 渡桥导师：2111
            case '🌉​ 渡桥导师':
                report = `
                你的教养风格是：<br>
                【🌉​ 渡桥导师】<br>
                制定严格的规则并全程陪伴跨越障碍，规则如冷却的岩浆既有硬度又有温度，通过理性沟通与情感共鸣双轨并行，培养既有韧性又有共情力的孩子。<br/>
                <br/>

                你就像孩子的导师，不仅在学业表现、社交礼仪等具体领域设定清晰标准,更对ta的性格养成与长远发展寄予厚望。你总是用爱和支持包围着ta,用理性编织的规则网与情感凝聚的防护绳，双重守护着ta的每一次前行。<br>
                你的高标准和深沉的爱,让孩子在学习和生活中都能闪闪发光。ta学会了挑战自己,虽然有时候也会因为想要做到最好而感到有点压力。因为你知道每个孩子的心灵都需要被温柔对待，所以你总是确保ta能感受到你的爱和支持，这样ta在成长的路上就能更自信、更有安全感。<br>
                你的教养风格如此有力，但是有时候你可能也会因为太紧张孩子的成长是否走在正轨上，而忍不住严厉批评和责备孩子。有时候这种方式确实有立竿见影的效果,但是这并不能教会孩子什么是对的，而只能让ta知道：爸爸妈妈生气了。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>


                 <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                与温和的“绵羊式”教育不同，你或许更倾向于严厉的养育方式，对孩子寄予较高期望，设定严格的纪律。这既是你“管孩子”的方式，也是你履行父母责任的体现。你就像一个严厉的导师，把握孩子成长的方向。<br>
                你也许听说过蔡美儿的“虎妈式育儿”。她所著的自传式育儿书籍《虎妈战歌》，详细记录了她对两个女儿近乎严苛的管教方式：制定十大戒律，运用高压手段要求孩子沿着父母规划的道路努力前行。她自己也曾直言不讳：“采用咒骂、威胁、贿赂、利诱等种种高压手段，促使孩子沿着父母为其选择的道路努力。”我们都深知过于严厉，会让孩子感到压抑和恐惧，从而失去自主探索和表达自我的勇气。<br>
                每位家长都怀揣着“望子成龙、望女成凤”的美好愿景，但请记得，孩子也需要被允许犯错。很多时候我们责备、批评孩子时，孩子最先感受到的并非我们所讲的道理，而是我们通过尖锐语言传递出的情绪信号：“我生气了”。这会让孩子更关注我们的情绪，而非我们真正想传达的道理。<br>
                长此以往，孩子可能会变得自卑、焦虑，害怕犯错。<br>
                下次，或许你可以尝试用更冷静、更温和的语气表达感受，循循善诱，向孩子解释规则背后的原因。<br>

                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                作为导师，你会给孩子的行为设定明确的界限，强调是非对错，会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中，“无所谓”的态度是不存在的，你带ta来到这个世界上，你会对ta负责，承担起父母的责任。<br>
                尽管你会尽力满足孩子的需求，但这是有界限的。必要的时候，你会拒绝孩子的过分要求，并对ta进行正确的引导。<br>



                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你是那种和孩子聊得来的家长，是孩子的知心朋友，因为你总能换位思考，充分考虑孩子的感受，并耐心地对待ta。有时，你也会让孩子表达自己的感受，给予ta回应。每一次的耐心沟通和引导，都使得你与孩子之间的纽带得以加深。<br>
                你允许孩子表达自己的意见，让ta学会从不同角度看待问题，培养孩子自主思考的能力，而不是被动接受父母的观点，你让ta意识到“自己也是这个家的一员”。尽管有时候孩子会犯错，让你火冒三丈，但你尽量让自己理性地与ta讨论，接纳ta的想法和感受。<br>
                在孩子的成长道路上，你尽力做好“引路人”的角色。你会让孩子理解行为的对错，而不仅仅是简单地惩罚或奖励。你会鼓励ta主动做出积极的选择，而不是通过强制手段强迫ta遵守规则。<br>


                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心，无论ta烦恼还是喜悦，你总能第一时间通过你的行为给ta安慰和支持。你的孩子常常会感受到被爱、被赞赏和被接纳。<br>
                无论多忙，你都会安排时间与孩子一起参与ta感兴趣的活动，比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，探索新事物，尝试不同的活动和兴趣，即使ta可能会失败，你也会支持ta。<br>


                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                扮演好父母角色是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成长为有责任感、自信和富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个在犯错中不断进步、克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当的放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持身心健康，更能让我们在育儿过程中更加从容。 <br>
                ●【庆祝努力和进步】：鼓励孩子不仅仅关注最终的成就，而是认识到努力过程中的进步同样重要。每当孩子在学习、体育或其他活动中付出努力时，即使结果不是完美的，也要表扬ta的坚持和努力。你可以举办小型的庆祝活动来认可ta的努力，比如家庭晚餐或周末的特别活动。<br>
                ●【作为榜样】：孩子往往会模仿父母的行为，你的行为和态度会在很大程度上影响孩子。努力在日常生活中展现出你希望孩子学习的价值观和行为，比如诚实、尊重、责任感和同情心。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //10 📜 法典学者：2112
            case '📜 法典学者':
                report = `
                以逻辑严密的“教育法典”指导行为，沟通侧重道理而非感情，塑造高度自律但情感内敛的个体。<br/>
                <br/>
                
                你就像一位严厉且严肃的法典学者，在你的家中，孩子清楚地知道哪些行为是被允许的，哪些是不被允许的。家中秩序井然，每条规矩不仅是行为的边界，更是自由的指引。你会向孩子解释规则背后的原因，让教养在他们心中生根发芽。在你的眼中，孩子是一个宝贵且充满潜力的独特个体，你用高标准为他们铺设成长阶梯。你始终尽己所能地提供指导和支持，帮助ta发现自己的价值和潜能。<br>
                但有的时候，可能因为关心则乱，你会忍不住严厉批评和责备孩子。有时候这种方式确实有立竿见影的效果，但是这并不能教会孩子什么是对的，而只能让ta知道：爸爸妈妈生气了。<br>
                另外，也许在日常生活中，你偶尔会因为某些原因而忽略了孩子的情感需求。孩子可能会认为你有时候比较冷漠。尽管如此，在孩子心里ta仍然爱你，就像你一直爱着ta。我们都知道，好的关系往往需要用心经营，下一次回到家的时候，尝试从一个拥抱或者微笑开始吧！<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>


                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                你或许更倾向于“虎妈式”的严厉教育，对孩子寄予高期望，像一位严谨的法官，为每种行为设定清晰的纪律。这种方式既是你“管教孩子”的手段，也是你履行父母责任的体现。<br>
                你或许认同蔡美儿在《虎妈战歌》中的育儿理念——通过高压手段和严格规则，推动孩子沿着父母规划的道路努力前行。然而，过于严苛的方式可能让孩子感到压抑，甚至害怕犯错，失去自主探索和表达自我的勇气。<br>
                每位家长都希望孩子成龙成凤，但孩子同样需要被允许犯错。责备和批评时，孩子最先感受到的往往不是道理，而是父母的情绪信号：“我生气了”。这会让孩子更关注父母的情绪，而非行为本身的问题。长此以往，孩子可能变得自卑、焦虑，甚至对失败产生过度恐惧。<br>
                或许可以尝试用更冷静、温和的方式表达感受。当孩子犯错时，与其简单地批评，不如蹲下身来，用清晰的逻辑解释规则背后的原因。比如，与其说“你怎么总是这么粗心”，不如说“我知道你很努力，但下次如果检查一遍，可能会更顺利”。<br>
                这样的沟通不仅能让孩子理解规则，还能让他们感受到被支持和被理解，从而更有信心面对挑战。<br>


                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                幸运的是，你会给孩子的行为设定明确的界限，强调是非对错，会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中，“无所谓”的态度是不存在的，你带ta来到这个世界上，你会对ta负责，承担起父母的责任。<br>
                面对孩子的过分要求，你像法典学者般坚持原则，以冷静的态度拒绝，并通过清晰的解释引导孩子理解规则的意义。这种既坚持原则又充满引导的教育方式，让孩子在规则的框架内探索自我。<br>



                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你像法典学者般为孩子制定规则，同时以知心朋友的身份倾听和引导。你鼓励孩子表达感受，参与规则讨论，培养自主思考能力。面对错误，你理性分析，解释规则逻辑，帮助孩子理解对错。<br>
                在规则框架内，你支持他们主动选择，而非强制服从。<br>
                这种既坚持原则又充满引导的教育方式，让孩子在秩序中感受到被尊重，逐渐成长为有独立思考能力的人。<br>


                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你像一位法典学者般严谨，为孩子的成长设定清晰的规则，但规则和理性沟通之外，情感支持同样不可或缺。在日常生活中，或许你习惯用成绩和规则衡量孩子的成长，却忽略了情感滋养的隐形力量。一个温暖的眼神、一句“今天在学校开心吗？”的问候，或是一个充满信任的目光，都能成为孩子内心的安全锚点。<br>
                拥抱、赞扬、支持、陪伴……这些都不是对规则的削弱，而是为规则注入温度，让孩子明白：无论规则多么严谨，爸爸妈妈的爱永远是他们最坚实的后盾。<br>


                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个在犯错中不断进步、克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当的放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持身心健康，更能让我们在育儿过程中更加从容。 <br>
                ●【为孩子提供情感支持的技巧】：
                    ○ 倾听与理解
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。
                    ○ 鼓励与支持
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”
                        ■ 关注进步：关注孩子的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”
                    ○提供陪伴
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。
                ●【庆祝努力和进步】：鼓励孩子不仅仅关注最终的成就，而是认识到努力过程中的进步同样重要。每当孩子在学习、体育或其他活动中付出努力时，即使结果不是完美的，也要表扬ta的坚持和努力。你可以举办小型的庆祝活动来认可ta的努力，比如家庭晚餐或周末的特别活动。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //11 🛡️ 静默盾牌
            case '🛡️ 静默盾牌：2121':
                report = `
                用行动而非语言传递保护欲，情感深沉但鲜少表达，从不解释规则缘由。爱意如铠甲厚重却笨拙，却可能让孩子感到疏离，常困惑于温暖与伤害的突然切换。<br>
                
                你像一为静默的守护者，用行动而非语言传递深沉的保护欲。你为孩子的未来精心规划，从学习到为人处世，都设定了清晰的目标，期望他们熠熠生辉。你的爱如同厚重的铠甲，无声却坚定地包围着孩子，给予他们安全感。<br>
                你始终陪伴在孩子身边，用高标准激励他们前行，但偶尔因关心则乱，会忍不住严厉批评。孩子最先捕捉到的不是道理，而是你的情绪信号：“爸爸妈妈生气了”。这种情绪化的反馈可能让孩子更关注你的反应，而非行为本身的意义，甚至在严厉与温柔的切换中感到困惑。<br>
                在沟通方面，你可能习惯于直接指出“不能这么做”，却较少解释“为什么不能这么做”。随着孩子认知能力的提升，他们需要的不仅是行为的结果，更是背后的逻辑。缺乏解释的规则如同未解码的法典，孩子可能遵守，却难以内化为自我驱动的行为准则。<br>
                积极的沟通和正向的引导对孩子人格发展、社会交往和价值观塑造十分重要。也许你已经意识到了这一点，并正在努力改进。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>

                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                与温和的“绵羊式”教育不同，你或许更倾向于严厉的养育方式，对孩子寄予较高期望，设定严格的纪律，像盾牌为孩子抵挡风雨。这既是你“管孩子”的方式，也是你履行父母责任的体现。<br>
                你或许认同蔡美儿在《虎妈战歌》中描述的“虎妈式育儿”，通过高压手段和清晰规则推动孩子沿着父母规划的道路前行。然而，过于严苛的方式可能让孩子感到压抑，甚至害怕犯错，失去自主探索的勇气。<br>
                每位家长都怀揣着“望子成龙、望女成凤”的美好愿景，但请记得，孩子也需要被允许犯错。很多时候我们责备、批评孩子时，孩子最先感受到的并非我们所讲的道理，而是我们通过尖锐语言传递出的情绪信号：“我生气了”。这会让孩子更关注我们的情绪，而非我们真正想传达的道理。<br>
                长此以往，孩子可能会变得自卑、焦虑，害怕犯错。<br>
                下次，或许你可以尝试用更冷静、更温和的语气表达感受，循循善诱地向孩子解释规则背后的原因。<br>



                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                你会给孩子的行为设定明确的界限，强调是非对错，会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中，“无所谓”的态度是不存在的，你带ta来到这个世界上，你会对ta负责，承担起父母的责任。<br>
                尽管你尽力满足孩子的需求，但这是有界限的——当孩子试图突破底线时，你会像盾牌挡住风暴一样，坚定地拒绝，并用清晰的引导为他们指明方向。<br>
                你用行动告诉孩子：规则不是束缚，而是帮助他们在复杂世界中找到安全的路径。你的盾牌不仅保护他们免受外界的伤害，也守护着他们内心的秩序感和安全感。<br>



                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                作为一名静默的守护者，你用无声的行动为孩子挡住外界的风雨。我们可能会认为“小孩子嘛，懂什么？只要跟ta说明对错就可以了”，但孩子对世界有自己的看法，ta也渴望被倾听和理解。<br>
                在日常生活中，你可能习惯于告诉孩子“不能这么做”，却很少解释“为什么不要这么做”。这种静默的教育方式可能让孩子感到困惑，无法在未来的场合做出适当的行为。事实上，孩子形成世界观的过程，正是我们进行引导的最佳时机。我们让孩子“明是非”，就需要同他们“讲道理”。<br>
                沟通不仅仅是语言，它包括你的眼神、语气、拥抱和亲吻。每一次互动都是交流的机会，但静默的盾牌可能让孩子误解你的意图。<br>
                另外，沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上，没有及时给与ta回应。<br>
                沟通是方式，引导是目的。你与孩子的交流不仅教会他们如何与他人互动，还塑造了他们的情感发展，并影响他们未来建立关系的能力。静默的盾牌虽然保护了孩子，但也可能阻碍了他们理解爱与支持的深度。是时候打破静默，让爱成为孩子一路高歌的主题曲。<br>




                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                拥抱、亲吻、微笑和夸奖传递，无论孩子是烦恼还是喜悦，你总能第一时间用这些细腻的行为给予安慰和支持。你的孩子常常感受到被爱、被接纳。<br>
                无论多忙，你都会安排时间与孩子一起参与ta感兴趣的活动，比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，探索新事物，尝试不同的活动和兴趣，即使ta可能会失败，你也会支持ta。<br>
                这些都像如同淬火工艺中熔合的金属，为盾牌注入了更深的韧性和力量。<br>


                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个在犯错中不断进步、克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当的放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持身心健康，更能让我们在育儿过程中更加从容。 <br>
                ●【正向引导】：<br>
                    ○ 直接表达你想让孩子做什么，而非不要做什么。例如，“好好走路”、或“坐在椅子上”，而不是“不要跑”、“不要大喊大叫”或“不要爬到桌子上” 。<br>
                    ○ 给孩子提供选择。让孩子有机会自己做选择，有助于ta感受到控制感，并让ta有机会练习做出正确的决定。例如，当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？ ”在措辞时，让孩子有机会决定如何遵守，这可以减少ta对指令的抵触情绪。<br>
                    ○ 为孩子制定清晰一致的规则。向孩子清楚地传达这些规则，并在孩子做到的时候，给与鼓励和夸奖。<br>
                ●【积极倾听】：通过使用鼓励性微笑和肯定性点头等动作，让你的孩子知道你正在认真倾听，你关心ta。当孩子与你交谈时，请俯下身子与孩子保持同一视线高度，这样可以帮助ta感到更安全，与你建立更紧密的联系。<br>
                ●【关注行为而非个人】：如果你对孩子某件事感到不满，请确保你的批评和评论是针对ta的行为，而不是针对个人。例如，不要说“我不喜欢你这么邋遢”，试着说“我不喜欢你把衣服扔得到处都是”。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //12 🗝️ 密码锁：2122
            case '🗝️ 密码锁':
                report = `
                规则至上，情感与解释皆匮乏，孩子需自行破解行为密码，易形成“完成任务”式思维，缺乏内在动力。<br/>
                <br/>

                你像一位掌管密码锁的守护者，严格且注重原则，为孩子的成长设定了清晰的规则。<br>
                在你的家庭中，规则如同密码锁的组合，孩子知道哪些行为可以开启认可之门，哪些行为会触发惩罚的警报。你期望孩子通过遵循这些规则，像输入正确的密码一样，获得成长的钥匙。<br>
                但有的时候，可能因为关心则乱，你会忍不住严厉批评和责备孩子。有时候这种方式确实有立竿见影的效果，但是这并不能教会孩子什么是对的，而只能让ta知道：爸爸妈妈生气了。这种情绪化的反馈可能让孩子更关注你的反应，而非行为本身的意义。<br>
                当孩子做出某些行为时，你可能只是简单地告诉他们“不能这么做”，而没有进一步解释“为什么不能这么做”。孩子只需输入“正确行为”的密码，却很少理解背后的逻辑。<br>
                积极的沟通和正向的引导，就像为密码锁添加“理解”的备用密码，对孩子人格发展、社会交往和价值观塑造至关重要。也许你已经意识到了这一点，并正在努力改进。<br>
                另外，也许在日常生活中，你偶尔会因为某些原因而忽略了孩子的情感需求。孩子可能会认为你有时候比较冷漠。我们都知道，好的关系往往需要用心经营，下一次回到家的时候，尝试从一个拥抱或者微笑开始吧！<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>


                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨权威控制</b></span><br>
                > 这一维度描述的是一种专制、命令、绝对控制的教养方式。其特点是父母在教育孩子时强调绝对服从，同时忽视孩子的感受和需求。长期处于这种环境中，孩子可能会变得叛逆、消极或缺乏独立性。<br>
                与温和的“绵羊式”教育不同，你或许更倾向于严厉的养育方式，对孩子寄予较高期望，设定严格的纪律，像盾牌为孩子抵挡风雨。这既是你“管孩子”的方式，也是你履行父母责任的体现。<br>
                你或许认同蔡美儿在《虎妈战歌》中描述的“虎妈式育儿”，通过高压手段和清晰规则推动孩子沿着父母规划的道路前行。然而，过于严苛的方式可能让孩子感到压抑，甚至害怕犯错，失去自主探索的勇气。<br>
                每位家长都怀揣着“望子成龙、望女成凤”的美好愿景，但请记得，孩子也需要被允许犯错。很多时候我们责备、批评孩子时，孩子最先感受到的并非我们所讲的道理，而是我们通过尖锐语言传递出的情绪信号：“我生气了”。这会让孩子更关注我们的情绪，而非我们真正想传达的道理。<br>
                长此以往，孩子可能会变得自卑、焦虑，害怕犯错。<br>
                下次，或许你可以尝试用更冷静、更温和的语气表达感受，循循善诱地向孩子解释规则背后的原因。<br>



                <span style="color: CornflowerBlue "><b>🚩溺爱</b></span><br>
                > 这一维度描述的是一种放任、忽视的教养方式。这种教养方式下，父母很少设定界限，孩子可能会变得任性、以自我为中心。这种教养风格可能会让孩子在成长过程中缺乏规则意识和自我约束能力。<br>
                你会给孩子的行为设定明确的界限，强调是非对错，会及时对孩子的错误行为进行纠正或约束。在对孩子的教育中，“无所谓”的态度是不存在的，你带ta来到这个世界上，你会对ta负责，承担起父母的责任。<br>
                当孩子试图突破底线时，你会像密码锁挡住错误的输入一样，坚定地拒绝。这种教育方式不仅是规则的设定，更是对孩子内心秩序感的培养。<br>



                <span style="color: CornflowerBlue "><b>🫠沟通引导</b></span><br>
                > 在父母教育孩子的过程中,“沟通引导”是一种重要的教育方式,它强调通过开放、平等的对话和交流,帮助孩子理解行为的后果、培养自主思考能力,并引导ta形成积极的行为模式和价值观。<br>
                你希望孩子通过遵循这些规则，像输入正确的密码一样，开启成长的大门。然而，这种教育方式有时会显得单向而冷峻，缺乏对规则背后逻辑的解释。<br>
                我们可能会认为“小孩子嘛，懂什么？只要跟ta说明对错就可以了”。但事实是，孩子对世界有自己的看法。他们需要的不仅是规则的密码，更是密码背后的逻辑。在日常生活中，可能大多数时候，你只是告诉孩子不能这么做，但却很少跟ta解释为什么不要这么做。这可能会让ta觉得困惑，并无法在今后的某些场合做出适当的行为表现。<br>
                事实上，孩子形成世界观的过程，正是我们进行引导的最佳时机。我们希望孩子“明是非”，就需要同ta“讲道理”。<br>
                另外，沟通不仅仅是语言沟通，你与孩子的每一次互动都是一种交流，包括了你说的话、你的语气、眼神以及你的拥抱和亲吻。<br>
                沟通过程中，倾听是一项重要技能。但遗憾的是，有时候孩子跟我们分享在学校发生的事，尽管我们在场，但我们的思绪和注意力在其他事情上，没有及时给与ta回应。<br>
                沟通是我们的方式，引导是我们的目的。你与孩子交流的方式不仅教会ta如何与他人交流，还塑造了ta的情感发展，并影响她在今后生活中建立关系。<br>




                <span style="color: CornflowerBlue "><b>🤟情感支持</b></span><br>
                > 情感支持是指父母在孩子生活中的情感参与，旨在鼓励孩子的个性发展，培养孩子的情绪调节能力。它有助于孩子在情感上获得安全感和自信心，为孩子的健康成长提供坚实的情感基础。<br>
                你为孩子的成长设定了像密码锁一般精准清晰的规则，确保了行为的边界，但别忘了，情感支持是开启孩子内心的另一把钥匙，它能让孩子在规则中找到温暖，在秩序中感到自由。<br>
                一个爱的眼神，或是一句“今天在学校开心吗？”的问候，都能成为孩子内心的安全锚点。<br>
                拥抱、赞扬、支持、陪伴……些就像是打开密码锁后，意外发现的爱的宝藏。<br>
                下次，不妨用温暖的拥抱代替简单的指令，用信任的目光传递支持，让孩子明白：无论规则多么严谨，爸爸妈妈的爱永远是他们最坚实的后盾。<br>


                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个在犯错中不断进步、克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当的放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持身心健康，更能让我们在育儿过程中更加从容。 <br>
                ●【积极倾听】：通过使用鼓励性微笑和肯定性点头等动作，让你的孩子知道你正在认真倾听，你关心ta。当孩子与你交谈时，请俯下身子与孩子保持同一视线高度，这样可以帮助ta感到更安全，与你建立更紧密的联系。<br>
                ●【关注行为而非个人】：如果你对孩子某件事感到不满，请确保你的批评和评论是针对ta的行为，而不是针对个人。例如，不要说“我不喜欢你这么邋遢”，试着说“我不喜欢你把衣服扔得到处都是”。<br>
                ●【正向引导】：
                    ○ 直接表达你想让孩子做什么，而非不要做什么。例如，“好好走路”、或“坐在椅子上”，而不是“不要跑”、“不要大喊大叫”或“不要爬到桌子上”  。<br>
                    ○ 给孩子提供选择。让孩子有机会自己做选择，有助于ta感受到控制感，并让ta有机会练习做出正确的决定。例如，当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？ ”在措辞时，让孩子有机会决定如何遵守，这可以减少ta对指令的抵触情绪。<br>
                    ○ 为孩子制定清晰一致的规则。向孩子清楚地传达这些规则，并在孩子做到的时候，给与鼓励和夸奖。<br>
                ●【为孩子提供情感支持的技巧】：<br>
                    ○ 倾听与理解<br>
                        ■ 耐心倾听：当孩子表达自己的想法或感受时，不要打断他们，耐心倾听他们的话语。让孩子知道他们的感受是被重视的。<br>
                        ■ 理解感受：尝试从孩子的角度理解他们的情绪，而不是立即评判或否定。例如，孩子因为考试成绩不理想而感到沮丧时，可以说：“我知道你很失望，这对你来说一定很难受。<br>
                    ○ 鼓励与支持<br>
                        ■ 肯定努力：当孩子尝试新事物或努力完成某项任务时，即使结果不理想，也要肯定他们的努力。例如：“虽然这次没有成功，但你已经很努力了，我为你感到骄傲。”<br>
                        ■ 关注进步：关注孩子的点滴进步，及时给予肯定。例如：“我看到你最近在学习上有了很大的进步，真棒！”<br>
                    ○ 提供陪伴<br>
                        ■ 共同活动：定期和孩子一起进行活动，如户外运动、阅读、手工等。<br>
                        ■ 关注兴趣：关注孩子的兴趣爱好，鼓励他们追求自己的兴趣。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //13 🌟 变幻围城：2211
            case '🌟 变幻围城':
                report = `
                擅长既用批评鞭策进步，又用物质奖励补偿。通过理性分析行为后果和亲密拥抱化解矛盾。但由于规则不明，易造成困惑和混乱，孩子只好小心翼翼地察言观色。<br/>
                <br/>

                你就像一座变幻围城，为孩子的成长营造了一个既温暖又复杂的环境。于你而言，孩子的教育似乎是一场在矛盾中寻找平衡的艺术。<br>
                你可能会有这样的感受：一方面渴望用民主对话让孩子的独立思考，另一方面孩子不听话的时候，又难以克制“必须听我的”的权威冲动，在情绪翻涌时骤然提高声调、没收平板，导致先前建立的理性沟通瞬间崩塌。<br>
                另外，你会用拥抱亲吻筑起温暖港湾，陪孩子探索世界、包容失败，但有时规则的边界并不明确，面对孩子的某些要求，你可能会在坚持与妥协之间摇摆不定——比如，孩子撒娇时你偶尔会心软答应。这种无条件的爱像甜蜜的沼泽，让孩子浸润于安全感的同时，也模糊了责任与行为的因果关联。<br>
                你既想成为孩子人生航程的灯塔，用权威划定安全的航道；又渴望化作托举翅膀的春风，用沟通给予自由的呼吸。<br>
                教育的真正挑战，或许在于承认这种矛盾的永恒性，并在每一次风暴来临前，学会用五分钟的冷静为理性留出锚点，用温柔的坚定为爱画出清晰的边界。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成长为有责任感、自信和富有同情心的人。<br>


                 <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨【高权威控制+高沟通引导——在“权威”与“沟通”之间寻找平衡点】</b></span><br>
                在教育实践中，你始终在权威引导与平等沟通之间寻找平衡。<br>
                一方面，你试图用民主对话建立信任，帮助孩子理解行为的后果，引导ta形成积极的行为模式和价值观。<br>
                另一方面，当孩子不听话时，权威的冲动又像潮汐般涌来，让你忍不住提高嗓门，甚至翻出旧账。这种教育方式充满了矛盾与张力，仿佛在理性与情绪之间不断切换。<br><br>

                你可能有过这样的体验——当孩子拖延作业时，先耐心分析作业难度，解释"如果现在不完成，等会儿玩游戏的时间就变少了"，甚至让孩子自己决定先做哪一科；可看到孩子继续磨蹭，又忍不住提高嗓门命令"马上去写！"，如果孩子顶嘴，直接没收平板电脑，情急之下还可能翻出"上次也是这样拖延"的旧账。<br><br>
                这种教育方式就像同时戴着两副面孔：内心深知“体罚会让孩子恐惧疏远”，但情绪失控时仍会控制不住自己；理论上明白"犯错是学习机会"，实践中却总忍不住提起过去的错误。<br>
                这些矛盾的根源，在于我们既渴望通过平等沟通培养孩子的独立思考，又难以放下"必须听我的"的权威执念。<br>
                孩子在这样的拉扯中容易迷失——他们分不清何时可以真诚表达，何时必须立即服从；看似被倾听的需求，最终总被父母的规则压倒。<br>
                这是很多父母在教育孩子过程中都会遇到的矛盾和挑战。或许我们可以尝试：设立规则时预留弹性空间，比如和孩子约定"周中完成作业后，周末游戏时间由你自己安排"；当情绪即将爆发前，先说"爸爸/妈妈现在需要冷静五分钟"。教育的艺术，或许就藏在"权威"与"沟通"的平衡支点上。<br>



                <span style="color: CornflowerBlue "><b>🚩【高溺爱+高情感支持——爱的无条件宣泄】</b></span><br>
                你会通过拥抱、亲吻、微笑等亲昵动作来表达爱和关心。无论多忙，你都会安排时间与孩子一起参与ta感兴趣的活动，比如一起画画、做手工或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，你鼓励孩子探索新事物，尝试不同的活动和兴趣，即使ta可能会失败，你也会支持ta。<br>
                毫无疑问，你对孩子倾注了无限的爱和关心。<br><br>
                另一方面，也许并没有达到溺爱的程度，但你可能会对孩子比较心软。你会尽力去满足孩子的物质需求。<br>
                有时候你可能会困惑：好吃好喝地对ta，ta怎么就不领情呢？<br>
                这可能是因为你常常在给予的时候，忘了给孩子设定明确的界限和规则。有时候孩子撒个娇就可以得到想要的玩具，有时候玩完玩具随地乱丢也没关系；孩子弄坏了玩具，立刻就能得到一个新的；孩子吃饭吃到一半就可以跑去玩……<br>
                这可能会让孩子逐渐缺失对规则的认知与尊重，做事时缺乏清晰的边界感，难以分辨哪些行为是恰当的，哪些是不合适的。在缺乏明确规则约束的环境中，孩子很难学会自我管理，也难以获得良好的自律能力。<br>




                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【设立规则和边界】：<br>
                    ○ 规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○ 告诉孩子ta可以做什么，而不是不可以做什么。例如，不要说“不要把蜡笔放进嘴里”，而要说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事，ta的注意力反而会集中在这件事情上，更容易引发逆反心理。<br>
                    ○ 明确告知孩子规则，如果ta已经到了能理解的年纪，跟ta解释规则背后的原因，这样ta遵守规则的概率会更高。<br>
                    ○ 明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○ 换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就吃”，而不是“不，该吃晚饭了！” <br>
                    ○ 与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>
                ●【给孩子提供选择】：让孩子有机会自己做选择，有助于ta感受到控制感，并让ta有机会练习做出正确的决定。例如，当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？”在措辞时，让孩子有机会决定如何遵守，这可以减少ta对指令的抵触情绪。<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个需要犯错和克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持心理健康，并在育儿过程中更加从容。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //14 🏰​ 糖霜堡垒
            case '🏰​ 糖霜堡垒：2221':
                report = `
                用甜蜜关怀包裹硬性规则，较少解释原因，孩子感受到保护却难理解边界本质，如同糖衣包裹的坚固城墙。<br/>
                <br/>

                你是一位既温暖又严格的家长，用甜蜜的关怀包裹坚硬的规则。在你眼中，孩子是无比宝贵且充满潜力的个体。你为孩子设定了高标准，激励他们追求卓越，同时用爱与支持为他们筑起安全感。<br>
                你就像一座高大宏伟的坚固城堡保护着你的孩子。一方面，你对孩子寄予厚望，要求他们绝对服从，你可能赞同“持续的批评是激励孩子遵守规则的最佳方式“；另一方面，你对规则保持沉默，当孩子做出某些不恰当的行为时，大多时候你可能只是告诉ta不能这么做，而非解释背后的原因。<br>
                尽管你对孩子比较严厉，但不乏温情。你给予孩子充分的情感支持，你常常表达关心，抽出时间陪伴孩子，通过一言一行表达自己的爱。这为坚硬城堡的外部涂上了美味的糖浆，又有几个孩子能拒绝甜食呢？<br>
                爱是糖浆，规则是城堡。糖浆让城堡温暖，但城堡的结构不能因此坍塌。过度的温情如果没有清晰的规则支撑，可能让孩子陷入“甜蜜的陷阱”，逐渐失去对行为边界的认知。这是许多父母都会遇到的挑战，如何在爱与规则之间找到平衡，是育儿的关键。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧! 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>


                 <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨【铁腕将军：高权威控制+低沟通引导】</b></span><br>
                在孩子面前，你就像一个威严的将军，为孩子铸造出一座堡垒，保护ta健康成长。相比于绵羊式的温情教育，你可能更倾向于严厉的养育，并对孩子注入了较高的期望。<br>
                你的权威不容置疑，你期望孩子按照你规划的蓝图成长。你也许赞同“持续的批评是激励孩子遵守规则的最佳方式“，孩子需要鞭策才能成长。<br>
                在军队中，将军下达命令，士兵执行，不需要过多的解释，这在行军打仗上是很有效率的。但在育儿上，这意味着一种不平等的沟通方式。<br><br>

                事实上，父母与孩子并非上下级的关系。我们可能会认为“小孩子嘛，懂什么？只要跟ta说明对错就可以了”。但孩子对世界有ta自己的认知与解释。<br>
                在日常生活中，可能大多数时候，你只是告诉孩子不能这么做，但却很少跟ta解释为什么不要这么做。这可能会让ta觉得困惑，并很难在今后的某些场合做出适当的行为。<br><br>

                其实，孩子形成世界观的过程，正是我们进行引导的最佳时机。我们希望孩子“明是非”，就需要同ta“讲道理”。孩子并非生来就懂得社会的规则和道德标准，ta需要通过与父母的互动，逐步理解行为的对错、善恶的界限。<br>
                如果我们只是简单地命令孩子，而不去解释背后的原因，ta可能会因为害怕惩罚而暂时服从，但并没有真正理解为什么要这样做。长此以往，孩子可能会变得被动、缺乏独立思考能力，甚至会对父母产生抵触情绪。<br>
                因此，在养育孩子的过程中，我们可以尝试从“铁腕将军”变成“智慧军师”，多一些耐心、沟通和引导。 当孩子做出不当行为时，不妨先冷静下来，用平和的语气与孩子交流，了解孩子这么做的原因。然后，耐心地向ta解释为什么这是错误的行为种行为不合适，以及正确的做法是什么。<br>



                <span style="color: CornflowerBlue "><b>🚩【糖霜美梦：高溺爱+高情感支持】</b></span><br>
                尽管你对孩子比较严厉，但不乏温情。<br>
                你会通过拥抱、亲吻、微笑、夸奖等行为来表达爱和关心。无论多忙，你都会安排时间与孩子一起参与ta感兴趣的活动，比如一起画画、一起唱歌、给ta讲睡前故事或参加户外运动。你们一起度过了许多温馨又快乐的时光。<br>
                你鼓励孩子在学习和生活中更加积极主动，你鼓励孩子探索新事物，尝试不同的活动和兴趣，即使ta可能会失败，你总会支持ta。<br>
                毫无疑问，你对孩子倾注了无限的爱和关心。<br><br>
                但有时候你可能会困惑：我这么爱ta，对ta无条件的支持和付出，，好吃好喝地对ta，ta怎么就不领情呢？<br>
                这可能是因为你常常在给予的时候，忘了给孩子设定明确的界限和规则。有时孩子撒个娇就可以得到想要的玩具，玩完玩具随地乱丢也没关系；孩子弄坏了玩具，立刻就能得到一个新的……这些看似无伤大雅的瞬间，给孩子编织了一场没有边界与规则的糖霜美梦。<br>
                在孩子眼中，世界仿佛成了一个没有明确边界的游乐场，ta难以分辨哪些行为是恰当的，哪些是不合适的。ta可能会简单地认为，只要观察父母是否生气了就行。在缺乏明确规则约束的环境中，孩子很难学会自我管理，也难以获得良好的自律能力。<br><br>
                毫无疑问，这是许多父母都会遇到的挑战：如何在爱与规则之间找到平衡？<br>
                在表达爱的同时，规则需要保持清晰而坚定。例如，当孩子因努力值得表扬时，用具体的夸奖代替额外的奖励；当他们因失败而沮丧时，用拥抱传递支持，而不是用零食转移注意力。<br>
                爱不是无条件的满足，而是帮助孩子建立正确的价值观和行为准则。规则也不是冷冰冰的约束，而是为孩子提供安全感和秩序感的保障。两者结合，孩子才能在温暖与秩序中茁壮成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个需要犯错和克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们保持心理健康，并在育儿过程中更加从容。<br>
                ●【设立规则和边界】：<br>
                    ○ 规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○ 告诉孩子ta可以做什么，而不是不可以做什么。例如，不要说“不要把蜡笔放进嘴里”，而要说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事，ta的注意力反而会集中在这件事情上，更容易引发逆反心理。<br>
                    ○ 明确告知孩子规则，如果ta已经到了能理解的年纪，跟ta解释规则背后的原因，这样ta遵守规则的概率会更高。<br>
                    ○ 明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○ 换种方式拒绝孩子。说“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就吃”，而不是“不，该吃晚饭了！” <br>
                    ○ 与你的家人达成一致。无论孩子是和你在一起，还是和你的家人在一起，规则都必须始终相同。<br>        
                ●【积极倾听】：通过使用鼓励性微笑和肯定性点头等动作，让你的孩子知道你正在认真倾听，你关心ta。当孩子与你交谈时，请俯下身子与孩子保持同一视线高度，这样可以帮助ta感到更安全，与你建立更紧密的联系。<br>
                ●【关注行为而非个人】：如果你对孩子某件事感到不满，请确保你的批评和评论是针对ta的行为，而不是针对个人。例如，不要说“我不喜欢你这么邋遢”，试着说“我不喜欢你把衣服扔得到处都是”。<br>
                ●【正向引导】：<br>
                    ○ 直接表达你想让孩子做什么，而不是不要做什么。例如，“好好走路”、或“坐在椅子上”，而不是“不要跑”、“不要大喊大叫”或“不要爬到桌子上”  。<br>
                    ○ 给孩子提供选择。让孩子有机会自己做选择，有助于ta感受到控制感，并让ta有机会练习做出正确的决定。例如，当你说“该收拾东西了”时，你可以给孩子一个选择，比如“你想先从书本还是积木开始？ ”在措辞时，让孩子有机会决定如何遵守，这可以减少ta对指示的抵触情绪。<br>
                    ○ 为孩子制定清晰一致的规则。向孩子清楚地传达这些规则，并在孩子做到的时候，并给与鼓励和夸奖。<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>
                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //15 ⚙️​ 齿轮摇篮：2222
            case '⚙️​ 齿轮摇篮':
                report = `
                机械式满足物质需求，但缺乏情感互动与解释，规则如齿轮般不可动摇，孩子易养成依赖性与被动性。<br/>
                <br/>

                你或许对育儿这件事感到有些沮丧，有时也会感受到较大的育儿压力，但有一件事是毫无疑问的——你深爱着你的孩子。<br>
                你希望通过明确的「行动-奖励」机制帮助孩子为目标努力，这种教育方式如同齿轮摇篮，机械式地满足物质需求，却缺乏情感互动与解释。“只要你做到我说的，要什么都可以”这种模式虽体现了深切关爱，却可能让孩子将爱与表现挂钩，形成“付出性价比”的交易思维。<br>
                你对孩子充满爱，但可能因现实压力或成长经历，形成“默默付出但疏于表达”的教育模式。日常互动中，你可能习惯单向指令，如直接命令而非解释原因；情感表达上可能显得冷漠，如敷衍回应孩子的分享；规则制定上可能缺乏灵活性，如直接否决孩子的提议。爱不仅是物质满足，更是触碰得到的温度。情感互动是孩子心理健康的基础，父母需要通过温暖的陪伴和积极的回应，为孩子提供安全感和归属感。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成长为有责任感、自信和富有同情心的人。<br>

                  <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨【交易式养育：高权威控制+高溺爱】</b></span><br>
                你也许希望通过明确的「行动-奖励」机制，让孩子学会为目标努力。你可能常常使用“只要你按我的要求做到，要什么都答应”的方法，这么做可能是出于：<br>
                    ① 焦虑：担心孩子未来缺乏竞争力，希望通过这种方式帮ta建立目标意识；<br>
                    ② 急切：希望用即时反馈让孩子快速看到努力的价值；<br>
                    ③ 保护欲：试图用物质奖励为孩子筑起一道护城河，避免ta经历你曾受过的苦<br>
                这种教育方式既体现了你对孩子的深切关爱，也反映了你希望ta在规则中找到方向的殷切期望，但可能会面临以下挑战。<br>

                面临的挑战</b><br>
                首先，在孩子眼中，世界逐渐被塑造成一个交易的舞台。<br>
                他们可能会形成这样的认知：“爸爸妈妈的爱与我的表现挂钩”，进而发展为“我必须完美达成要求才值得被爱”。<br>
                这种认知促使孩子采取特定的行为策略，他们开始计算“付出性价比”，例如，认为练琴1小时换取游戏机时间是值得的，而主动帮妈妈洗碗没有奖励则“不值得做”。<br><br>

                第二，随着孩子的成长，家长面临的挑战日益凸显。<br>
                奖励机制逐渐陷入“通胀危机”，孩子的需求从玩具升级到手机、出国旅行等更高层次的物质要求，家长的承诺可能超出其承受范围。<br>
                同时，“情感账户透支”的风险也在增加，当孩子未能达标却仍索要奖励时，容易引发“你凭什么不守信用”的冲突。<br><br>

                第三，亲子关系也在这套机制下悄然发生变化。<br>
                孩子可能会开始从“协作”转向“博弈”，用“你不买球鞋，我就不写作业”这样的方式反向要挟家长。<br>
                更令人遗憾的是，孩子可能错失了成长中的珍贵教育契机。例如，按家长要求考取100分后，孩子却可能忽略了“独立解题的成就感”这一更深层次、更持久的内在奖励。这种教育方式的长期影响，值得每一位家长深思。<br><br>

                或许我们可以这样调整</b><br>
                与其让爱变成「交易筹码」，不如试着把「条件式养育」转化为「成长型陪伴」。<br>
                你可以每天关注并夸奖孩子与成就无关的努力瞬间，如“你愿意再试一次的样子特别酷”，让孩子感受到“无论结果如何，努力的过程都值得被看见”。<br>
                你还可以试着将个人任务转化为家庭合作的共同目标，比如“我们一起挑战21天学习计划”，让孩子从“执行者”变为“合作者”，将外在激励转化为内在的家庭团队精神。<br>
                通过这些方式，帮助孩子在规则中找到意义，在爱中获得力量。<br><br>

                你比任何奖励都珍贵 </b><br>
                当孩子某天突然说：“妈妈，这次我不要玩具，你陪我去图书馆找资料就行”，你会突然发现：那些曾用来交换条件的物质奖励，正在被你们共同创造的情感记忆所取代。<br>
                教育不是一场精确计算的交易，而是一段共同成长的旅程。你不需要做完美的导航员，只要愿意和孩子并肩探索。<br><br>



                <span style="color: CornflowerBlue "><b>🚩【铁丝妈妈vs布料妈妈：低沟通引导+低情感支持】</b></span><br>
                爱的本质是触碰得到的温度</b><br>
                1959年，美国心理学家哈洛做了一个实验，他让新生的婴猴从出生第一天起同母亲分离，以后的165天中同两个母亲在一起——铁丝妈妈和布料妈妈。铁丝妈妈的胸前挂着奶瓶，布料妈妈没有。虽然当婴猴同铁丝妈妈在一起时能喝到奶，但它们宁愿不喝奶，也愿同布料妈妈呆在一起。<br>
                哈洛的实验给予我们一定启示：父母对孩子的养育不能仅仅停留在喂饱层次，爱的本质是触碰得到的温度，情感互动同样重要。<br><br>

                你对孩子怀着深切的爱意，却可能因为种种现实压力或成长经历的局限，在教育中形成了「默默付出但疏于表达」的模式。<br>
                在日常互动中，你可能存在以下无意识模式：<br>
                1、沟通中的「单向指令」</b><br>
                    ●当孩子爬高时脱口而出：“快下来！”而不是：“这个高度摔下来可能会受伤哦。”<br>
                    ●孩子问“为什么必须早睡”时回答：“小孩子别问这么多”。<br>
                2、情感表达的「节能模式」 </b><br>
                    ●孩子哭着说被朋友冷落时，递纸巾却继续刷手机：“这点小事哭什么”。<br>
                    ●孩子兴高采烈分享学校趣事时，边洗碗边“嗯嗯”回应，眼神始终没离开水池。<br>
                3、规则制定的「封闭系统」</b><br>
                    ●孩子提出“周末想和同学去图书馆”，立即否决：“在家复习更安全。”<br>

                善意的盲区</b><br>
                这些互动模式的形成可能是因为一些善意的盲区。<br>
                ① 坚信“行动胜于言语”，认为努力工作供孩子上学、准备营养三餐就是爱的全部体现，却忽略了情感交流的重要性。<br>
                ② 误解了“坚强教育”，担心过于温柔会宠坏孩子，因此故意保持严肃的姿态，却忽视了孩子的内心需求。<br>
                ③ 陷入代际循环，由于自己童年时鲜少体验情感互动，不知不觉中复制了父母的教养方式，延续了缺乏情感支持的教育模式。<br>
                这些盲区并非出于恶意，而是源于对爱的表达方式和教育理念的局限性。<br><br>

                我们都在学习爱的语言  </b><br>
                没有人生来就是完美父母，就像孩子也在跌跌撞撞学习走路。<br>
                如果你曾在这些场景中看到自己的影子，请给自己一个温柔的拥抱——这恰恰证明你在认真思考如何做得更好。<br>
                下一次当孩子跑向你时，试着先给ta一个微笑的眼神；下一次制定规则前，试着问一句“你觉得这样安排怎么样”。<br>
                这些小小的改变，就像在亲子之间架起一座彩虹桥，让爱从此岸到彼岸的传递，有了更温暖的路径。<br>
                请相信，你早已给了孩子最好的礼物——那份默默守护的初心。现在，只需要为这份爱添上几缕可见的光。<br><br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ● ① 给奖励加上「意义滤镜」 </b><br>
                    「原模式」：“连续一周练琴1小时，就买新球鞋”  <br>
                    「升级版」：“这周你克服困难坚持练琴，妈妈想用特别的方式纪念你的毅力——我们可以选：A. 把《致爱丽丝》录下来发给姥姥听 B. 周末去公园野餐庆祝 C. 买那双你想要的荧光色鞋带”  <br>
                    「教育价值」：把物质奖励转化为「成长里程碑纪念」，同时提供情感价值选项 <br>
                ● ② 设置「无条件的爱」安全网  </b><br>
                    每天找出1件与成就无关的夸奖，例如“今天看你帮妹妹捡玩具的样子，妈妈觉得好温暖”，“你失败后愿意再试一次的样子特别酷”  <br>
                    关键在于：“无论结果如何，你努力的过程都值得被看见”  
                ● ③ 把「你的要求」变成「共同目标」  </b><br>
                    「原模式」：“每天背20个单词，坚持一个月给你买Switch”  <br>
                    「共创版」：“妈妈想和你一起挑战21天学习计划，我每天早起做早餐，你每天背单词。完成后我们可以用攒下的外卖钱去露营！”  <br>
                    「教育价值」：让孩子从「执行者」变为「合作者」，把外在激励转化为家庭团队精神<br>
                ● ④ 每日增加1次「翻译式沟通」</b><br> 
                    把“赶紧写作业”变成：“写完作业我们就有时间玩你喜欢的拼图啦！”<br>
                    把“不许顶嘴”变成：“你刚才的话让我有点难过，我们可以换个方式说吗？”<br>
                ● ⑤ 开放「规则修订会」 </b><br>
                    每月选个周末，全家边吃零食边讨论：“你觉得现在的看电视时间合理吗？”<br>
                ● ⑥ 寻求专业的帮助</b><br>
                    大多数父母是第一次当爸爸妈妈，有所吃力是很正常的事情，很少有人能够第一次就把事情做到完美。令人庆幸的是，你不是一个人，专业人士能够为你提供帮助。他们可以帮助你学习如何管理情绪、应对日常压力并发展出应对机制，让你能够以更健康的方式照顾孩子。<br><br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                </p>
                `;
                break;
            //16 ⚖️ 矛盾导师：2212
            case '⚖️ 矛盾导师':
                report = `
                往往批评责罚后立即买玩具安抚，打一个巴掌给一个甜枣，奖惩并用。理性沟通和引导却回避拥抱等亲密行为。孩子易缺少归属感，追求自己的独立。<br/>
                <br/>

                对于孩子，你是一位严格理性的导师。你为孩子设定了高标准，激励他追求卓越。在ta的成长旅程中，你始终尽己所能地提供指导和支持，帮助ta发现自我价值和潜能。<br>
                但你偶尔会感到困惑和矛盾，尝试在批评与沟通之间寻找平衡。你希望孩子不仅能遵守规则，还能理解规则背后的意义。这可能会让你在权威与沟通之间挣扎。<br>
                于你而言，孩子的教育似乎是一场在矛盾中寻找平衡的艺术。当孩子犯错受罚时，你可能因不忍面对他们的眼泪，转身就用新玩具安抚情绪，这种"惩戒与补偿"的行为矛盾和“底线坚守与弹性妥协”的规则矛盾，可能会让孩子既错失反思错误的机会，又模糊了规则的边界。<br>
                另外，在快节奏的现代生活中，当工作压力蚕食亲子时光，你试图用物质满足填补情感空缺，却在无意间让拥抱、微笑、鼓励这些最质朴的爱之语言，逐渐被淹没在玩具堆砌的补偿机制里。物质补偿与情感陪伴的失衡可能会让孩子分不清爱与规则的真正模样。<br>
                这是很多父母都会面临的挑战。其实表达爱的方式远不止物质满足——一个温暖的拥抱、充满赞许的微笑、真诚的鼓励话语，或是专注的陪伴时光，这些都是滋养孩子心灵的爱之语言。<br>
                总体而言，成为好父母是一件非常不容易的事情，辛苦了！未来也请继续用你的爱和智慧，为孩子的成长提供支持性的引导吧！ 你的努力和付出将帮助孩子成为一个有责任感、自信且富有同情心的人。<br>

                <hr>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                接下来你将从【权威控制】、【溺爱】、【沟通引导】和【情感支持】四大方面继续了解你的教养风格。<br>
                <br>

                 <span style="color: CornflowerBlue "><b>🤨【高权威控制+高沟通引导——在“权威”与“沟通”之间寻找平衡点】</b></span><br>
                > 在教育实践中，你始终在权威引导与平等沟通之间寻找平衡。<br>
                你对孩子寄予厚望，要求他们绝对服从，你认为持续的批评是激励孩子遵守规则的最佳方式，同时你也深知沟通和讲道理的重要性。<br>
                
                一方面，你试图用民主对话建立信任，帮助孩子理解行为的后果，引导ta形成积极的行为模式和价值观；另一方面，当孩子不听话时，权威的冲动又让你忍不住提高嗓门，甚至翻出旧账。这种教育方式充满了矛盾与张力，仿佛在理性与情绪之间不断切换。<br>
                你可能有过这样的体验：<br>
                    当孩子拖延作业时，先耐心分析作业难度，解释"如果现在不完成，等会儿玩游戏的时间就变少了"，甚至让孩子自己决定先做哪一科；可看到孩子继续磨蹭，又忍不住提高嗓门命令"马上去写！"，如果孩子顶嘴，直接没收平板电脑，情急之下还可能翻出"上次也是这样拖延"的旧账。<br>
                这种教育方式就像同时戴着两副面孔：内心深知“体罚会让孩子恐惧疏远”，但情绪失控时仍会控制不住自己；理论上明白"犯错是学习机会"，实践中却总忍不住提起过去的错误。<br><br>
                这些矛盾的根源，在于我们既渴望通过平等沟通培养孩子的独立思考，又难以放下"必须听我的"的权威执念。<br>
                孩子在这样的拉扯中容易迷失——他们分不清何时可以真诚表达，何时必须立即服从；看似被倾听的需求，最终总被父母的规则压倒。<br>
                在教育中，找到批评与沟通的平衡点至关重要。规则是成长的框架，而沟通是框架内的温度。通过批评让孩子明确行为的边界，通过沟通让他们理解规则的意义。<br>
                或许我们可以尝试：设立规则时预留弹性空间，比如和孩子约定"周中完成作业后，周末游戏时间由你自己安排"；当情绪即将爆发前，先说"爸爸/妈妈现在需要冷静五分钟"。教育的艺术，或许就藏在"权威"与"沟通"的平衡支点上。<br>



                <span style="color: CornflowerBlue "><b>🚩【高溺爱+低情感支持——补偿式的爱】</b></span><br>
                周一因工作忙没陪孩子，周二内疚买玩具；周三因作业吼孩子，周四心软买零食...<br>
                你是否对这种情况感到熟悉？这是一种典型的“补偿式的爱”。你可能在忙碌或者情绪失控后，由于愧疚感，于是用一些物质来补偿孩子。<br>
                或者，你只是不知道如何给予孩子情感支持，你不习惯跟孩子开玩笑、拥抱等，于是想要在物质上对ta进行补偿。<br>
                但这种方式却在无形中给孩子传递了混乱的信号。<br>
                孩子可能会逐渐学会用情绪来操控父母，不断试探父母的底线。一旦不被满足，就通过哭闹或反抗来换取想要的东西。长此以往，孩子不仅会逐渐缺失对规则的认知与尊重，做事时缺乏清晰的边界感，难以分辨哪些行为是恰当的，哪些是不合适的，还会在内心深处缺乏真正的安全感和归属感。<br>
                另外，在快节奏的时代，许多父母常常误将物质补给当作情感代餐。你表达爱的方式是否只剩下“给ta买想要的东西”？其实爱的表达有很多种。<br>
                有时候可以是一个爱的眼神，也可以是用“今天在学校开心吗？”来代替“今天学到了什么？”；还可以是一个充满信任的目光。<br>
                拥抱、赞扬、支持、陪伴……这些都传递了一个信号，那就是：爸爸妈妈永远爱你。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                成为好父母是一件非常不容易的事情，辛苦了！未来也请继续以你的爱和智慧，为孩子的成长提供引导。你的努力将帮助孩子成为一个有责任感、自信且富有同情心的人。你还可以：<br>
                ●【允许孩子犯错】：把错误当成孩子学习的机会。孩子失败或犯错可能会令人失望，但是鼓励ta继续尝试并帮助ta进步，都是在告诉ta：学习是一个需要犯错和克服挑战的过程。<br>
                ●【情绪管理】：偶尔也别忘了给自己适当的放松和缓解压力。可以尝试做瑜伽、冥想、运动、深呼吸，这些都能帮助我们在育儿过程中更加从容。 <br>
                ●【设立规则和边界】：<br>
                    ○ 规则要简短，并且适合孩子的年龄。例如：“你把积木收起来之后，就可以去外面玩了。”、“如果你乱扔玩具，那你以后就不能玩它。”<br>
                    ○ 告诉孩子ta可以做什么，而不是不可以做什么。例如，不要说“不要把蜡笔放进嘴里”，而要说“把蜡笔拿在手里，像这样。”如果你只是告诉孩子不要做某事，ta可能不知道你想让ta做什么。<br>
                    ○ 明确告知孩子规则，如果ta已经到了能理解的年纪，跟ta解释规则背后的原因，这样ta遵守规则的概率会更高。<br>
                    ○ 明确后果并坚定执行。如果孩子违反了你设定的规则，坚定地按照预先告知的后果来执行。<br>
                    ○ 换种方式拒绝孩子。“不”的次数越少，孩子就越有可能遵守规则。例如，如果你的孩子在饭前想吃糖果，你可以说“好啊，吃完晚饭后就吃”，而不是“不，该吃晚饭了！” <br>
                    ○ 与你的伴侣达成一致。无论孩子是和你在一起，还是和你的伴侣在一起，规则都必须始终相同。<br>
                ●【为孩子提供情感支持的技巧】：<br>
                    ○ 倾听孩子的烦恼，给予关心和建议<br>
                    ○ 尽管很忙，仍安排与孩子相处的时间<br>
                    ○ 多看到孩子积极的一面，及时鼓励和表扬<br>
                    ○ 尝试安排一些亲子活动，比如：一起画画、做手工或参加户外运动、一起做饭<br>
                    ○ 关注孩子的情绪变化<br>
                ●【保持学习】：作为父母，不断学习和更新自己的育儿知识和技能是非常重要的。你可以通过多种方式学习，比如阅读最新的育儿书籍、参加育儿讲座或研讨会，还可以考虑与专业人士交流，比如心理学家、教育专家等，以了解如何更好地支持孩子的成长。<br>

                <hr>
                <p text-align: center>【未来教养升级指南】</p>
                <p style="font: 16pt 微软雅黑; text-align: left; line-height: 1.6em">
                基于你的测评结果，推荐挑战任务。<br>
                任务一:父母情绪管理7天打卡计划<br>
                任务二:家庭秩序重构7天打卡计划<br>
                任务三:亲子沟通7天打卡计划<br>
                任务四:情感支持7天打卡计划<br>
                任务五:育儿观念7天升级计划<br>
                
                </p>
                `;
                break;
            default:
                report = "未知类型：未匹配到任何已知组合。";
        }
    } else {
        report = "error";
    }

    return report;
}

/* JS Functions from the R package 'jspsychr' */

save_locally = function() {
    var data = jsPsych.data.get().csv()
    var xhr = new XMLHttpRequest()
    xhr.open('POST', 'submit')
    xhr.setRequestHeader('Content-Type', 'application/json')
    xhr.send(JSON.stringify({ filedata: data }))
};
